УРВ_файловая/src/Documents/Обращение/Обращение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Обращение</name>
  <registerRecords>AccumulationRegister.ЗначенияПоказателей</registerRecords>
  <registerRecords>InformationRegister.ГолосаПользователейЗаПожелания</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияОбращений</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентОбслуживающейОрганизации</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПереписки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>Витрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПолучения</name>
    <type>
      <types>CatalogRef.КаналыПолученияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаБазыЗнаний</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.КомпонентыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПрикрепилКарточку</name>
    <comment>Пользователь, который прикрепил к обращению карточку базы знаний</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСокращенный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжиданиеОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодпискаНаТариф</name>
    <type>
      <types>DocumentRef.Подписка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученНовыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.Разделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннееОбращение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнутренними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетСвязьСВнешними</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбращенияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнешниеОбращения</name>
    <attributes>
      <name>Обращение</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Catalogs/Ошибки/Ошибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ошибки</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <comment>Номер ошибки во внешней системе учета ошибок</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Воспроизведение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоспроизведениеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПуть</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбходнойПутьХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКарточка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеАвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисыСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаИсправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Витрина</name>
      <type>
        <types>CatalogRef.Витрины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутренняяПереписка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполненПеренос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <comment>Разделы базы знаний</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/CommonForms/Топ10/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыДляВыбора = Новый Массив();
	ПараметрыДляВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Сервис));
	Элементы.КомпонентСписок.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыДляВыбора);
	
	ТипКарточек = "Консультации";
	КоличествоДнейОтбораОбращений = 10;
	ЗаполнитьТоп10();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ТипКарточек = Настройки.Получить("ТипКарточек");
	Если ТипКарточек <> Неопределено Тогда
		Настройки.Удалить("ТипКарточек");
	КонецЕсли;
	
	КоличествоДнейОтбораОбращений = Настройки.Получить("КоличествоДнейОтбораОбращений");
	Если КоличествоДнейОтбораОбращений <> Неопределено Тогда
		Настройки.Удалить("КоличествоДнейОтбораОбращений");
	КонецЕсли;
	
	ОтображатьЗакрытые = Настройки.Получить("ОтображатьЗакрытые");
	Если ОтображатьЗакрытые <> Неопределено Тогда
		Настройки.Удалить("ОтображатьЗакрытые");
	КонецЕсли;
	
	ЗаполнитьТоп10();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Топ10Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СсылкаНаЭлемент = Топ10.НайтиПоИдентификатору(ВыбраннаяСтрока).Ссылка;
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Ошибки") Тогда
		ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаЭлемент));
	ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Пожелания") Тогда
		ОткрытьФорму("Справочник.Пожелания.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаЭлемент));
	ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Консультации") Тогда
		ОткрытьФорму("Справочник.Консультации.ФормаОбъекта", Новый Структура("Ключ", СсылкаНаЭлемент));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПриИзменении(Элемент)
	
	ЗаполнитьТоп10();
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеПодбора = КомпонентСписок.ВыгрузитьЗначения();
	
	Оповещение = Новый ОписаниеОповещения("КомпонентСписокНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеПодбора", ДанныеПодбора);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Сервис));
	 
	ОткрытьФорму("Справочник.КомпонентыСервиса.Форма.ФормаПодбора", ПараметрыФормы, Элементы.КомпонентСписок, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокПриИзменении(Элемент)
	
	ЗаполнитьТоп10();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеПодбора = РазделСписок.ВыгрузитьЗначения();
	
	Оповещение = Новый ОписаниеОповещения("РазделСписокНачалоВыбораЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ДанныеПодбора", ДанныеПодбора);
	 
	ОткрытьФорму("Справочник.Разделы.Форма.ФормаПодбора", ПараметрыФормы, Элементы.РазделСписок, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокПриИзменении(Элемент)
	
	ЗаполнитьТоп10();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКарточекПриИзменении(Элемент)
	
	ЗаполнитьТоп10();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНастроитьНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ГиперссылкаНастроитьНажатиеЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоличествоДнейОтбораОбращений", КоличествоДнейОтбораОбращений);
	ПараметрыФормы.Вставить("ИспользоватьОтображатьЗакрытые", ТипКарточек <> "Консультации");
	ПараметрыФормы.Вставить("ОтображатьЗакрытые", ОтображатьЗакрытые);
	ПараметрыФормы.Вставить("ТипКарточек", ТипКарточек);
	 
	ОткрытьФорму("ОбщаяФорма.УстановкаНастроекДляТоп10",ПараметрыФормы,ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТоп10()
	
	Если Не ЗначениеЗаполнено(ТипКарточек) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	БазаЗнаний.Ссылка,
		|	БазаЗнаний.Наименование КАК Тема,
		|	БазаЗнаний.Код КАК Код,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обращение.Ссылка) КАК КоличествоОбращений
		|ИЗ
		|	Справочник.Консультации КАК БазаЗнаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Обращение КАК Обращение
		|		ПО БазаЗнаний.Ссылка = Обращение.КарточкаБазыЗнаний
		|			И (Обращение.Дата >= &ДатаОтбораОбращений)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборСервисы = ЛОЖЬ
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ БазаЗнаний.Сервисы.Сервис В (&Сервисы)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборКомпоненты = ЛОЖЬ
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ БазаЗнаний.Компоненты.Компонент В (&Компоненты)
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтборРазделы = ЛОЖЬ
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ БазаЗнаний.Разделы.Раздел В (&Разделы)
		|		КОНЕЦ
		|	%УсловиеОтбора%
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаЗнаний.Ссылка,
		|	БазаЗнаний.Наименование,
		|	БазаЗнаний.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОбращений УБЫВ";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Консультации", ТипКарточек);
	
	Если ТипКарточек <> "Консультации" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%УсловиеОтбора%","
		|И ВЫБОР
		|			КОГДА &ОтображатьЗакрытые
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ БазаЗнаний.Состояние В (&СостоянияЗакрытых)
		|		КОНЕЦ
		|");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%УсловиеОтбора%","");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ОтборСервисы", ЗначениеЗаполнено(Сервис));
	Запрос.УстановитьПараметр("ОтборКомпоненты", КомпонентСписок.Количество() > 0);
	Запрос.УстановитьПараметр("ОтборРазделы", РазделСписок.Количество() > 0);
	Запрос.УстановитьПараметр("Сервисы", Сервис);
	Запрос.УстановитьПараметр("Компоненты", КомпонентСписок.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Разделы", РазделСписок.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ДатаОтбораОбращений", НачалоДня(ТекущаяДатаСеанса()) - КоличествоДнейОтбораОбращений*86400);
	Запрос.УстановитьПараметр("ОтображатьЗакрытые", ОтображатьЗакрытые);
	
	СостоянияЗакрытых = Новый Массив;
	СостоянияЗакрытых.Добавить(Перечисления.СостоянияОшибок.Исправлена);
	СостоянияЗакрытых.Добавить(Перечисления.СостоянияПожеланий.Реализовано);
	
	Запрос.УстановитьПараметр("СостоянияЗакрытых", СостоянияЗакрытых);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Топ10.Загрузить(РезультатЗапроса.Выгрузить());
	
	ПрописьЧисла     = ЧислоПрописью(КоличествоДнейОтбораОбращений, "Л = ru_RU", НСтр("ru = ',,,,,,,,0'"));
	ПрописьЧислаИДни = ЧислоПрописью(КоличествоДнейОтбораОбращений, "Л = ru_RU", НСтр("ru = 'день, дня, дней,,,,,,0'"));
	ЧислоИДни = СтрЗаменить(ПрописьЧислаИДни, ПрописьЧисла, Формат(КоличествоДнейОтбораОбращений, "ЧГ=") + " ");
	
	Элементы.ГиперссылкаНастроить.Заголовок = СтрШаблон(НСтр("ru='Отбор обращений за %1%2'"), 
		ЧислоИДни, ?(ОтображатьЗакрытые, НСтр("ru=', с закрытыми'"),"")); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНастроитьНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		КоличествоДнейОтбораОбращений = Результат.КоличествоДнейОтбораОбращений;
		ОтображатьЗакрытые = Результат.ОтображатьЗакрытые;
		ЗаполнитьТоп10();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделСписокНачалоВыбораЗавершение(Результат, ПараметрыДляВыбора) Экспорт
	
	Если Результат <> Неопределено Тогда
		РазделСписок.ЗагрузитьЗначения(Результат);
		ЗаполнитьТоп10();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентСписокНачалоВыбораЗавершение(Результат, ПараметрыДляВыбора) Экспорт
	
	Если Результат <> Неопределено Тогда
		КомпонентСписок.ЗагрузитьЗначения(Результат);
		ЗаполнитьТоп10();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
